tutorials/heatTransfer/buoyantBoussinesqSimpleFoam/iglooWithFridges/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 265;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    wall
    {
        type            fixedValue;
        value           uniform 265;
    }

    twoFridgeFreezers_seal_0
    {
        type            fixedValue;
        value           uniform 303;
    }

    twoFridgeFreezers_herring_1
    {
        $twoFridgeFreezers_seal_0;
    }
}

// ************************************************************************* //
